Repository: rirufa/FooEditor.UWP
Catalog: Strings/*/Resources.resw
Source language: en
Languages: ja_jp

# AddButton.Label
source: New Document
ja_jp: 新規作成

# DocumentTypeLabel.Text
source: Document types
ja_jp: 文章タイプ

# EnableRTL.Header
source: Show right-to-left
ja_jp: 右から左に表示する

# EndRowLabel.Text
source: Last row
ja_jp: 最終行

# FileTypesPageCommand.Content
source: File Type
ja_jp: ファイルタイプ

# FindButtonLabel.Content
source: Search
ja_jp: 検索

# FindPatternLabel.Text
source: Search for
ja_jp: 検索対象

# FontFamilyLabel.Text
source: Font
ja_jp: フォント

# FontSizeLabel.Text
source: Font size
ja_jp: フォントサイズ

# LineJumpButtonLabel.Content
source: Jump
ja_jp: ジャンプ

# NewDocumentTitle
source: Untitled {0}
ja_jp: 無題{0}

# RemoveButton.Content
source: Delete
ja_jp: 削除

# ReplaceAllButton.Content
source: Replace all
ja_jp: 全て置換

# ReplaceButtonLabel.Content
source: Replace
ja_jp: 置換

# ReplacePattern.Text
source: Replace for
ja_jp: 置換対象

# RestrictSearchLabel.Content
source: Casesenstive
ja_jp: 大文字と小文字を区別する

# GlobalSettingPageCommand.Content
source: Global Setting
ja_jp: グローバル設定

# SharedDataTitle
source: The selected string
ja_jp: 選択された文字列

# ShowCaretLine.Header
source: Show caret line
ja_jp: キャレットラインを表示する

# ShowDetailButton.Content
source: Detail
ja_jp: 詳細

# ShowFullSpace.Header
source: Show full-space
ja_jp: 全角スペースを表示する

# ShowLineNumber.Header
source: Show line-numbers
ja_jp: 行番号を表示する

# ShowRuler.Header
source: Show rulers
ja_jp: ルーラを表示する

# ShowTab.Header
source: Show tab
ja_jp: タブを表示する

# TabCharLabel.Text
source: Tab size
ja_jp: タブサイズ

# ToRowLabel.Text
source: Line number
ja_jp: 行番号

# UseGroupLabel.Content
source: Apply group when replacing
ja_jp: 置き換え時にグループ指定を行う

# UseRegExLabel.Content
source: Use regular expressions
ja_jp: 正規表現を使用する

# PrivacyButton.Content
source: Privacy Policy
ja_jp: プライバシーポリシー

# SettingCommandTitle
source: Global
ja_jp: グローバル設定

# HomeTitle.Text
source: Home
ja_jp: ホーム

# OpenLocalButton.Text
source: Open File...
ja_jp: ファイルを開く...

# NewListGroup
source: New
ja_jp: 新規作成

# RecentListGroup
source: Recently files
ja_jp: 最近使用したファイル

# LineNumberOutOutOfRange
source: The line number must be in the range of {1} from {0}.
ja_jp: 行番号の値は{0}から{1}の範囲内でなければなりません

# LineBreakMethodCharUnit
source: Break line by char count
ja_jp: 任意の文字数で折り返す

# LineBreakMethodNone
source: Do not break line
ja_jp: 折り返さない

# LineBreakMethodPageBound
source: Break line by width
ja_jp: 右端で折り返す

# LineBreakCountLabel.Text
source: Linebreak count
ja_jp: 折り返しの文字数

# LineBreakLabel.Text
source: LineBreak
ja_jp: 折り返し

# FindPatternTextBox.[using:Windows.UI.Xaml.Automation]AutomationProperties.Name
source: Search for
ja_jp: 検索対象

source: Replace for
ja_jp: 置換対象

# ToRowTextBox.[using:Windows.UI.Xaml.Automation]AutomationProperties.Name
source: Jump to line
ja_jp: ジャンプ先の行

# MagnificationPowerFormat
source: Magnification Power:{0}%
ja_jp: 拡大率:{0}%

# TextPointFormat
source: Row:{0} Col:{1}
ja_jp: 行:{0} 桁:{1}

# NoInherit.Header
source: Does not aplly global setting
ja_jp: グローバル設定を適用しない

# ExtensionListLable.Text
source: aplly for extensions
ja_jp: 適用する拡張子

# ShowLineBreak.Header
source: Show line break
ja_jp: 改行マークを表示する

# EncodeTypeLabel.Text
source: Encoding
ja_jp: 文字コード

# NoButton
source: No
ja_jp: いいえ

# YesButton
source: Yes
ja_jp: はい

# LineFeedTypeLabel.Text
source: Line feed
ja_jp: 改行コード

# GoToButton.Label
source: Line Jump
ja_jp: 行ジャンプ

# PropertyButton.Label
source: Document Property
ja_jp: ドキュメントのプロパティ

# RedoButton.Label
source: Redo
ja_jp: やり直す

# SaveLocalButton.Text
source: Save
ja_jp: 上書き保存

# SearchButton.Label
source: Search
ja_jp: 検索

# UndoButton.Label
source: Undo
ja_jp: 元に戻す

# ShowFoundPattern.Header
source: Show found pattern
ja_jp: 検索パターンを表示する

# NotFoundInDocument
source: You have searched to the end of the document
ja_jp: ドキュメントの終わりまで検索しました

# BottomMarginLabel.Text
source: Padding of bottom
ja_jp: 下方向の余白

# FooterLabel.Text
source: Fotter
ja_jp: フッター

# HeaderLabel.Text
source: Header
ja_jp: ヘッダー

# LeftMarginLabel.Text
source: Padding of left
ja_jp: 左方向の余白

# PrintSettingPageCommand.Content
source: Print Setting
ja_jp: 印刷設定

# RightMarginLabel.Text
source: Padding of right
ja_jp: 右方向の余白

# TopMarginLabel.Text
source: Padding of top
ja_jp: 上方向の余白

# InchiLabel
source: ※A unit of padding is inch
ja_jp: ※余白の単位はインチです

# MetricLabel
source: ※A unit of padding is mm
ja_jp: ※余白の単位はミリです

# PurchaseButton.Content
source: Purchase
ja_jp: 購入する

# AllDocumentsLabel.Content
source: Target for all documents
ja_jp: 全てのドキュメントを対象にする

# DiscardDocumentMessage
source: Do you close the{0}?
ja_jp: {0}を閉じますか

# SupportButton.Content
source: Help and Support
ja_jp: ヘルプとサポート

# AboutPageCommand.Content
source: About
ja_jp: このアプリについて

# VersionText
source: Version {0}
ja_jp: バージョン {0}

# IndentBySpace.Header
source: Indent by space
ja_jp: スペースで字下げを行う

# EnableAutoIndent.Header
source: Enable AutoIndent
ja_jp: オートインデンドを有効にする

# PrintButton.Label
source: Print
ja_jp: 印刷

# SettingButton.Label
source: Setting
ja_jp: 設定

# EnableAutoComplete.Header
source: Enable AutoComplete
ja_jp: 自動補完を有効にする

# OutlineTree.Label
source: OutlineTree
ja_jp: アウトラインツリー

# Snipeet.Label
source: Snippets
ja_jp: スニペット

# RestoreUsareStateMessage
source: Are you sure to restore previous documents?
ja_jp: ドキュメントを復元しますか

# SaveAsButton.Text
source: SaveAs
ja_jp: 名前を付けて保存する

# NotifySaveCompleteText
source: Saved as {0}
ja_jp: {0}で保存しました

# DefaultEncodeTypeLabel.Text
source: Default Encoding
ja_jp: デフォルトの文字コード

# AddExtentionButton.Content
source: Add
ja_jp: 追加

# EnableAutoSave.Header
source: Save current document at regular interval
ja_jp: 一定間隔ごとに現在の状態を保存する

# OpenAsEncodeButton.Text
source: OpenFileByEncoding...
ja_jp: 文字コードでファイルを開く...

# OpenAsEncodeDialog.Title
source: OpenFileByEncoding
ja_jp: 文字コードでファイルを開く

# OpenAsEncodeDialog.SecondaryButtonText
source: Cancel
ja_jp: キャンセル

# OpenFromMRU.Text
source: OpenRecently...
ja_jp: 最近開いたファイル...

# OpenRecentlyDialog.PrimaryButtonText
source: Open
ja_jp: 開く

# OpenRecentlyDialog.SecondaryButtonText
source: Cancel
ja_jp: キャンセル

# OpenRecentlyDialog.Title
source: OpenRecently
ja_jp: 最近開いたファイル

# SaveAsEncodeButton.Text
source: Save as encoding...
ja_jp: 文字コードでファイルを保存する...

# SaveAsEncodeDialog.SecondaryButtonText
source: Cancel
ja_jp: キャンセル

# SaveAsEncodeDialog.Title
source: Save as encoding
ja_jp: 文字コードでファイルを保存する

# OpenButton.Label
source: Open File
ja_jp: ファイルを開く

# SaveButton.Label
source: Save
ja_jp: 保存

# OpenConfigureFolder.Content
source: Open App Setting Folder
ja_jp: 設定フォルダーを開く

# ReopenConfirm
source: To change some status,it discord all changes. Do you want to continue?
ja_jp: 変更を有効にするには今までの変更を破棄し、再度ファイルを開く必要があります。続行しますか？

# EnableGenerateFolding.Header
source: Enable folding
ja_jp: 折り畳みを有効にする

# EnableSyntaxHilight.Header
source: Enable Syntax Hilight
ja_jp: シンタックスハイライトを有効にする
